000102211018             PGM
000103211018             CALL       QGPL/STRJOB
000105211018             ADDLIBLE   BCI433LIB
000106211108             addlible   senecapay
000107211018             MONMSG     MSGID(CPF2103)
000108211018             DSPSYSLVL  OUTPUT(*DISPLAY)
000109211018             ENDPGM
000110211018
