000100210930       DCL-F AutoInsDsp workstn;
000101211017       DCL-F EXITDSP workstn;
000103211017        dcl-s  RATE packed(5:3);
000105211018       DCL-S DATE2 DATE(*ISO);
000106211018       DCL-S DUEDATE DATE(*ISO);
000107210930       EXSR CLEAR;
000108210930       EXFMT AutoInfo;
000109210930       DOW NOT(*IN03);
000110211018             DATE2 = D'2022-04-30';
000111211018          DUEDATE = %DIFF(DATE2:%DATE():*D);
000112211018          TES2 = DUEDATE;
000113211018           VYEAR = DUEDATE ;
000114210930         IF ReplaceVAL = 0;
000115210930           *IN97 = *ON;
000116210930           EXFMT AutoInfo;
000117210930           *IN97 = *OFF;
000118210930           ITER;
000119211018
000120210930         ELSEIF Kilometres = 0;
000121210930           *IN98 = *ON;
000122210930           EXFMT AutoInfo;
000123210930           *IN98 = *OFF;
000124210930           ITER;
000125211017         ELSEIF VYear <= d'1886-01-28';
000126210930           *IN99 = *ON;
000127210930           EXFMT AutoInfo;
000128210930           *IN99 = *OFF;
000129210930           ITER;
000130211017         ELSEIF VYear >= %DATE();
000131211017           *IN50 = *ON;
000132211017           EXFMT AutoInfo;
000133211017           *IN50 = *OFF;
000134211017           ITER;
000135210930         ELSE;
000136210930           EXSR DetermineCost;
000137210930         ENDIF;
000138210930         *IN75 = *ON;
000139210930         WRITE AutoInfo;
000140210930         EXFMT AutoQuote;
000141210930         *IN75 = *OFF;
000142210930         IF *IN03 = *OFF;
000143210930           EXSR CLEAR;
000144210930           EXFMT AutoInfo;
000145210930         ENDIF;
000146210930       ENDDO;
000147211017       EXFMT EXITRECORD;
000148211017       SELECT;
000149211017         WHEN OPTION = 1;
000150211017           EXFMT INSUREINFO;
000151211017         WHEN OPTION = 2;
000152211017           EXFMT COMPINFO;
000153211017       ENDSL;
000154210930       *INLR = *ON;
000155210930       RETURN;
000156210930
000157210930       BEGSR CLEAR;
000158210930         ReplaceVAL = 0;
000159210930         Kilometres = 0;
000160211017         ACCS = 0;
000161211017         TRAFS = 0;
000162211017         DERMS = 0;
000163210930         VYear = d'0001-01-01';
000164211017         MESSAGE = '';
000165210930       ENDSR;
000166210930       BEGSR DetermineCost;
000167211017          EXSR KilometerRate;
000168211017         EXSR DrivingRecord;
000169211017         AGE = %DIFF(%DATE():VYEAR:*Y);
000170211017         COST =REPLACEVAL * RATE;
000171211017         RATE = 0;
000172210930       ENDSR;
000173211017
000174211017       BEGSR KilometerRate;
000175211017            SELECT;
000176211017              WHEN (KILOMETRES >=60000);
000177211017                RATE = 0.03;
000178211017              WHEN (KILOMETRES >=40000);
000179211017                RATE = 0.026;
000180211017              WHEN (KILOMETRES >=20000);
000181211017                RATE = 0.023;
000182211017              WHEN (KILOMETREs >= 10000);
000183211017                RATE = 0.02;
000184211017              WHEN (KILOMETRES >= 1);
000185211017                RATE = 0.013;
000186211017            ENDSL;
000187211017        ENDSR;
000188211017        BEGSR DrivingRecord;
000189211017            SELECT;
000190211017              WHEN (DERMS >= 13);
000191211017                RATE += 0.03;
000192211017              WHEN (DERMS >=10);
000193211017                RATE += 0.028;
000194211017              WHEN (DERMS >= 5);
000195211017                RATE += 0.025;
000196211017              WHEN (DERMS >= 1);
000197211017                RATE += 0.02;
000198211017            ENDSL;
000199211017            SELECT;
000200211017              WHEN (ACCS > 3);
000201211017                RATE += 0.3;
000202211017                MESSAGE = 'WE CANNOT ACCEPT YOUR APPLICATION';
000203211017              WHEN (ACCS = 3);
000204211017                RATE += 0.5;
000205211017              WHEN (ACCS = 2);
000206211017                RATE += 0.4;
000207211017            ENDSL;
000208211017            SELECT;
000209211017              WHEN (TRAFS >= 4);
000210211017                RATE += 0.3;
000211211017                MESSAGE = 'WE CANNOT ACCEPT YOUR APPLICATION';
000212211017              WHEN (TRAFS = 3);
000213211017                RATE += 0.01;
000214211017              WHEN (TRAFS > 1);
000215211017                RATE += 0.05;
000216211017            ENDSL;
000217211017       ENDSR;
