000100211018    DCL-F IncomeTDsp workstn;
000101211018        dcl-s  ALLINQ2 packed(2);
000102211018        dcl-s  ALLINCOME2 packed(7:2);
000103211018        dcl-s  ALLTAXES2 packed(6:2);
000104211018        dcl-s  DEDUCT packed(6);
000105211018        dcl-s  NETINCOME2 packed(7);
000106211018        dcl-s  TAXRATE2 packed(6:2);
000107211018        dcl-s  TAXAMOUNT packed(6:2);
000108211018        dcl-s  DAYSTO packed(3);
000109211018
000110211018       EXSR CLEAR;
000111211018       EXFMT MoneyMade;
000112211018       DOW NOT(*IN03);
000113211018         IF TotalMoney = 0;
000114211018           *IN33 = *ON;
000115211018           EXFMT MoneyMade;
000116211018           *IN33 = *OFF;
000117211018           ITER;
000118211018         ELSEIF MarStatus =  ;
000119211018           *IN34 = *ON;
000120211018           EXFMT MoneyMade;
000121211018           *IN34 = *OFF;
000122211018           ITER;
000123211018         ELSEIF EducationX > 5000;
000124211018           EducationX = 5000;
000125211018           EXFMT MoneyMade;
000126211018         ELSEIF Charitable > 10000;
000127211018           Charitable = 10000;
000128211018           EXFMT MoneyMade;
000129211018         ELSE;
000130211018           EXSR DetermineCost;
000131211018         ENDIF;
000132211018         *IN26 = *ON;
000133211018         WRITE MoneyMade;
000134211018         EXFMT TaxOwing;
000135211018         *IN75 = *OFF;
000136211018         IF *IN03 = *OFF;
000137211018           EXSR CLEAR;
000138211018           EXFMT MoneyMade;
000139211018         ENDIF;
000140211018       ENDDO;
000141211018	EXFMT Summary;
000142211018
000143211018       *INLR = *ON;
000144211018       RETURN;
000145211018
000146211018       BEGSR CLEAR;
000147211018         TotalMoney = 0;
000148211018         EducationX = 0;
000149211018         Charitable = 0;
000150211018         MarStatus = '';
000151211018       ENDSR;
000152211018
000153211018       BEGSR DetermineCost;
000154211018          DEDUCT = EDUCATIONX + CHARITABLE;
000155211018	  NETINCOME2 = TOTALMONEY  DEDUCT;
000156211018         IF MARSATUS = Y;
000157211018		SELECT;
000158211018			WHEN (NETINCOME2 > 600000);
000159211018				TAXRATE = 0.36;
000160211018			WHEN (NETINCOME2 > 400000);
000161211018				TAXRATE = 0.34;
000162211018			WHEN (NETINCOME2 > 315000);
000163211018				TAXRATE = 0.31;
000164211018			WHEN (NETINCOME2 > 165000);
000165211018				TAXRATE = 0.23;
000166211018			WHEN (NETINCOME2 > 77400);
000167211018				TAXRATE = 0.21;
000168211018			WHEN (NETINCOME2 > 19050);
000169211018				TAXRATE = 0.11;
000170211018			WHEN (NETINCOME2 > 0);
000171211018				TAXRATE = 0.09;
000172211018		ENDSL;
000173211018	  ELSE;
000174211018		SELECT;
000175211018			WHEN (NETINCOME2 > 500000);
000176211018				TAXRATE = 0.36;
000177211018			WHEN (NETINCOME2 > 200000);
000178211018				TAXRATE = 0.34;
000179211018			WHEN (NETINCOME2 > 157500);
000180211018				TAXRATE = 0.31;
000181211018			WHEN (NETINCOME2 > 82500);
000182211018				TAXRATE = 0.23;
000183211018			WHEN (NETINCOME2 > 38700);
000184211018				TAXRATE = 0.21;
000185211018			WHEN (NETINCOME2 > 9525);
000186211018				TAXRATE = 0.11;
000187211018			WHEN (NETINCOME2 > 0);
000188211018				TAXRATE = 0.09;
000189211018		ENDSL;
000190211018	  ENDIF;
000191211018	  TAXAMOUNT = NETINCOME2 * TAXRATE;
000192211018         AGE = %DIFF(%DATE():VYEAR:*Y);
000193211018         COST =REPLACEVAL * RATE;
000194211018         RATE = 0;
000195211018	  DEDUCTIONS = DEDUCT;
000196211018	  NETINCOME = NETINCOME2;
000197211018	  TAXAMT = TAXAMOUNT;
000198211018	  ALLINQ2++;
000199211018	  ALLINCOME2 += NETINCOME2;
000200211018	  ALLTAXES2 += TAXAMOUNT;
000201211018       ENDSR;
000202211018
000203211018
