000100211213       DCL-F SHIFTWEEK USAGE(*INPUT) KEYED RENAME(SHIFTWEEK:SHIFTWEEKR);
000101211213       DCL-F PAYPGMMENU WORKSTN;
000102211213       DCL-F PAYPGM WORKSTN;
000107211213       EXFMT RECORD1;
000108211213       DOW NOT *IN03;
000109211213
000110211213            SELECT;
000111211213              WHEN (INPUT = '1');
000112211213                 EXSR CLEARSR;
000114211213                 EXSR LOADSR;
000115211213
000117211213            ENDSL;
000148211213
000149211213       ENDDO;
000150211213
000151211213       *INLR = *ON;
000152211213       RETURN;
000153211213
000154211213       BEGSR CLEARSR;
000155211213         *IN50 = *OFF;
000156211213         WRITE SFLCTL;
000157211213         *IN50 = *ON;
000158211213       ENDSR;
000159211213       BEGSR LOADSR;
000160211213         READ SHIFTWEEK;
000161211213         DOW NOT %EOF;
000162211213           WRITE SFLDATA;
000163211213           READ SHIFTWEEK;
000164211213         ENDDO;
000165211213       ENDSR;
