000101211209          Dcl-Pr DayNumName Char(9);
000200200402           DayIn Packed(1);
000300181112          End-Pr;
000301211209          DCL-PR MonthNumName CHAR(9);
000302211209            DayIn Packed(2);
000303211209          END-PR;
